snlkuharlocal/src/Documents/МаркировкаТоваровИСМП/МаркировкаТоваровИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаркировкаТоваровИСМП</name>
  <comment>Маркировка товаров ИСМП</comment>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.СписаниеТМЦ</basedOn>
  <basedOn>Document.ОтчетКассовойСмены</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.ЗаданиеНаМаркировку</basedOn>
  <basedOn>Document.ЗаданиеНаСборкуКомплектовЧЗ</basedOn>
  <basedOn>Document.ЛистНабора</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.МаркировкаТоваровИСМП</basedOn>
  <basedOn>Document.КонтрактСПроизводителем</basedOn>
  <basedOn>Document.РекламационнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.ИспользованныеКодыАгрегаций</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_ЧЗ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиДоступныхКМ</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <registerRecords>InformationRegister.ВыданныеКодыАгрегаций</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииИСМП</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ДокументаЧЗ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыДокументовИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПервичногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторГосКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортерИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращаемыйТоварБылОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеНанесения</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКодовSSCC</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>фКодыАгрегацийДляПоставщиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусыАктуализированы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПокупателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>КодАгрегации</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>18</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодНабора</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументАгрегации</name>
      <type>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробок</name>
    <attributes>
      <name>ШтрихкодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ЛистПереукладки</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.Комплектация</types>
        <types>DocumentRef.ОтчетКассовойСмены</types>
        <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
        <types>DocumentRef.КонтрактСПроизводителем</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
        <types>DocumentRef.Инвентаризация</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ЛистНабора</types>
        <types>DocumentRef.СписаниеТМЦ</types>
        <types>DocumentRef.ЗаданиеНаМаркировку</types>
        <types>DocumentRef.МаркировкаТоваровИСМП</types>
        <types>DocumentRef.Машина</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/CommonModules/МаркировкаК/Module.bsl
Функция ОткрытьФормуНастроекЧЗ() Экспорт
	#ЕСЛИ ТолстыйКлиентОбычноеПриложение ТОГДА
	Обработки.АпиЧЗ.ПолучитьФорму("НастройкаПараметров").Открыть();
	#КОНЕЦЕСЛИ 
КонецФункции //ОткрытьФормуНастроекЧЗ() Экспорт

Процедура УстановитьСтатусДокументаМаркировки(ДокСсылка, Статус, ТекстОшибки = Неопределено ) Экспорт
	#ЕСЛИ ТолстыйКлиентОбычноеПриложение ТОГДА
	Реквизты = Новый Структура("Статус", Статус);
	Если ТекстОшибки <> Неопределено Тогда
		Реквизты.Вставить("ТекстОшибки", ТекстОшибки);	
	КонецЕсли; 
	УстановитьРеквизитыОбъекта(ДокСсылка, Реквизты);
					
	ОповеститьОбИзменении(ДокСсылка);
	Оповестить("ИзмененСтатус", , ДокСсылка);
	#КОНЕЦЕСЛИ
КонецПроцедуры //УстановитьСтатусДокументаМаркировки(ДокСсылка, Статус) Экспорт

Процедура ОткрытьПодчиненныеДокументы_МаркировкаТоваровИСМП(Список, ВидОперации) Экспорт
	ТекДанные = Список.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда                          
		ДокСсылка = ТекДанные.Ссылка;
		
		Если ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ВидыОперацийИСМП") Тогда
			ПараметрыВыбора = Новый Структура("Отбор", Новый Структура("ДокументОснование,ВидОперацииИСМП", ТекДанные.Ссылка, ВидОперации));		
			ОткрытьФорму("Документ.МаркировкаТоваровИСМП.ФормаСписка", ПараметрыВыбора, , ДокСсылка);			
		ИначеЕсли ТипЗнч(ВидОперации) = Тип("ПеречислениеСсылка.ВидыОперацийМаркировки") Тогда		
			ПараметрыВыбора = Новый Структура("Отбор", Новый Структура("ДокументОснование,ВидОперации", ТекДанные.Ссылка, ВидОперации));		
			ОткрытьФорму("Документ.МаркировкаТоваровИСМП.ФормаСписка", ПараметрыВыбора, , ДокСсылка);
		Иначе			
			Сообщить("Недопустимый тип параметра отбора по виду операции: " + ТипЗнч(ВидОперации), СтатусСообщения.Важное);		
		КонецЕсли; 		
	Иначе
		Сообщить("Не выбран док. основание !", СтатусСообщения.Важное);
	КонецЕсли;

КонецПроцедуры

Процедура ОткрытьПодчиненныеДокументы_ЗаказКМ(Список, ВидОперации) Экспорт
	ТекДанные = Список.ТекущиеДанные;
	Если ТекДанные<>Неопределено Тогда                          
		ДокументОснование = ТекДанные.Ссылка;
		
		ПараметрыВыбора = Новый Структура("Отбор", Новый Структура("ДокументОснование", ДокументОснование));		
		ОткрытьФорму("Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.ФормаСписка", ПараметрыВыбора, , ДокументОснование);		
	Иначе
		Сообщить("Не выбран док. основание !", СтатусСообщения.Важное);
	КонецЕсли;
КонецПроцедуры

Процедура ВоспроизвестиЗвукОшибки(КоличествоПовторов = 0) Экспорт
	oVoice = Новый COMObject("SAPI.SpVoice");
	oSpFileStream = Новый COMObject("SAPI.SpFileStream");	
	
	ИмяФайла = Маркировка_ПИ.КаталогВнешнихОтчетов() + "Alert.wav";
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		oSpFileStream.Open(ИмяФайла);
		oVoice.SpeakStream(oSpFileStream);
		Если КоличествоПовторов > 0 Тогда
			Для Сч = 2 По КоличествоПовторов Цикл
				oVoice.SpeakStream(oSpFileStream);				
			КонецЦикла;	
		КонецЕсли;	
		oSpFileStream.Close();
	Иначе
		Сигнал();
	КонецЕсли;
КонецПроцедуры

Функция ВывестиОшибки(рОбработки) Экспорт
	ТекстСообщения = СтрСоединить(рОбработки.Ошибки, Символы.ПС);
	Сообщить(ТекстСообщения, СтатусСообщения.Важное);
	
	Возврат ТекстСообщения;
КонецФункции //ВывестиОшибки(рОбработки) Экспорт
 
Функция ВывестиСообщения(рОбработки, Знач Статус = Неопределено) Экспорт
	Если Статус = Неопределено Тогда
		Статус = СтатусСообщения.БезСтатуса;	
	КонецЕсли; 
	Сообщения		= МаркировкаКС.ПолучитьЗначениеПараметра(рОбработки, "Сообщения", Новый Массив);
	ТекстСообщения	= "";
	
	Если Сообщения.Количество() > 0 Тогда	
		ТекстСообщения = СтрСоединить(Сообщения, Символы.ПС);
		Сообщить(ТекстСообщения, Статус);
	КонецЕсли;
	
	Возврат ТекстСообщения;
КонецФункции //ВывестиСообщения(рОбработки) Экспорт

Функция ПолноеИмяФайла(ИмяКаталога, ИмяФайла) Экспорт
	мКаталог= СокрЛП(ИмяКаталога);
	РП = ПолучитьРазделительПутиКлиента();
	Если НЕ СтрЗаканчиваетсяНа(мКаталог, РП) Тогда
		мКаталог = мКаталог + РП;	
	КонецЕсли;
	
	Возврат мКаталог + ИмяФайла;
КонецФункции //ПолноеИмяФайла(ИмяКаталога, ИмяФайла)

Функция ЗаписатьИзмененныйОбъектВУпрФорме(УпрФорма, Провести = Ложь) Экспорт
	
	Если УпрФорма.Модифицированность ИЛИ (Провести И НЕ УпрФорма.Объект.Проведен) Тогда		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(УпрФорма.Объект.Ссылка)) Тогда //Документ
			Если Провести Тогда
				ТекстВопроса = "Для выполнения данной операции необходимо провести документ. Провести ?";			
			Иначе
				ТекстВопроса = "Для выполнения данной операции необходимо записать документ. Записать ?";			
			КонецЕсли;			
		Иначе // Справочник
			ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		КонецЕсли; 
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		Иначе
			Попытка
				Если Провести Тогда					
					Возврат УпрФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
				Иначе                           
					Возврат УпрФорма.Записать();					
				КонецЕсли;				
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции // ЗаписатьИзмененныйОбъектВУпрФорме()

Функция ЗаписатьНовыйОбъектВУпрФорме(УпрФорма) Экспорт
	
	Если УпрФорма.Объект.Ссылка.Пустая() Тогда
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(УпрФорма.Объект.Ссылка)) Тогда
			ТекстВопроса = "Для выполнения данной операции необходимо записать документ. Записать?";
		Иначе // Справочник
			ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";
		КонецЕсли; 
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		Иначе
			Попытка
				Возврат УпрФорма.Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат Ложь;
			КонецПопытки;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли; 
	
КонецФункции // ЗаписатьНовыйОбъектВФорме()

Функция ПроверкаРазрешенияРедактированияУФ(УФ) Экспорт
	Результат = Истина;
	Если УФ.Объект.Дата <= КонецДня(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()) Тогда
		УФ.ТолькоПросмотр = Истина;	
		Результат = Ложь;
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции //ПроверкаРазрешенияРедактирования(УФ) Экспорт

Функция ВвестиКоды() Экспорт
	мКоды = Новый Массив;
	
	СтрокаКодов = "";
	Если ВвестиСтроку(СтрокаКодов, "Введите коды маркировки", , Истина) Тогда
		Для Каждого Строка Из СтрРазделить(СтрокаКодов, Символы.ПС) Цикл
			Строка = СтрЗаменить(Строка,"(01)","");		
			Строка = СтрЗаменить(Строка,"(21)","");		
			Строка = СтрЗаменить(Строка," ","");
			
			мКоды.Добавить(Строка);
		КонецЦикла;
		
		мКоды = МаркировкаС.НайтиКоды(мКоды);
	КонецЕсли;
	
	Возврат мКоды;
КонецФункции //ВвестиКоды() Экспорт

Функция ЗаписатьФактСканирования(ШтрихКод, ДокументСканирования = Неопределено, ДопПараметры = Неопределено) Экспорт
	Если НЕ Маркировка_ПИ.ЗаписыватьКаждыйЩелчокСканера() Тогда Возврат Неопределено КонецЕсли;
	
	Попытка
		МаркировкаС.ЗаписатьФактСканирования(ШтрихКод, ДокументСканирования, ДопПараметры);
	Исключение                                   
		ТекстСообщения = СтрШаблон("Ошибка записи пика ! ШК: '%1', док-т: '%2', ошибка: '%3' !", СокрЛП(ШтрихКод), ДокументСканирования, ОписаниеОшибки());
		ЗаписатьВЛог("Фиксация пиков", ТекстСообщения, "Ошибка"); 
	КонецПопытки;
КонецФункции //ЗаписатьФактСканирования(ШтрихКод, ДокументСканирования, ДопПараметры = Неопределено) Экспорт
